Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES - Copy/01.Source/rl78i1c/application/dlms2/usercode/r_dlms_usercode_class03.c
/******************************************************************************
* DISCLAIMER

* This software is supplied by Renesas Electronics Corporation and is only 
* intended for use with Renesas products. No other uses are authorized.

* This software is owned by Renesas Electronics Corporation and is protected under 
* all applicable laws, including copyright laws.

* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES 
* REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, 
* INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
* PARTICULAR PURPOSE AND NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY 
* DISCLAIMED.

* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS 
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE 
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES 
* FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS 
* AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.

* Renesas reserves the right, without notice, to make changes to this 
* software and to discontinue the availability of this software.  
* By using this software, you agree to the additional terms and 
* conditions found by accessing the following link:
* http://www.renesas.com/disclaimer
******************************************************************************/
/* Copyright (C) 2018 Renesas Electronics Corporation. All rights reserved.  */
/******************************************************************************	
* File Name    : r_dlms_usercode_class03.c
* Version OCG  : 1.0.7 - Dec 30 2022 - 523f50b0cadaf461e67e821551f18ee49d82598e
* Device(s)    : RL78I1C
* Tool-Chain   : CCRL 1.05
* H/W Platform : None
* Description  : Config for OBIS layer and DLMS Library DLMS_LIB_V23
******************************************************************************
* History			: DD.MM.YYYY Version Description
* Generated date    : 03/01/2023 
******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/

#include <string.h>
#include <stddef.h>
#include <math.h>
#include "r_dlms_usercode_class03.h"

/* User Code */
#include "r_dlms_app.h"
#include "inst_read.h"
#include "r_dlms_storage.h"
#include "r_tariff.h"
#include "em_measurement.h"
#include "r_dlms_cumulate.h"
#include "r_loadsurvey.h"
#include "r_scheduler.h"
/******************************************************************************
Macro definitions
******************************************************************************/

/******************************************************************************
Typedef definitions
******************************************************************************/

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/

/* User code variable */


/* User code function */
/******************************************************************************
* Function Name : GET_ImportApparentEnergyTariff
* Description   : Mark get/set service successfully
* Arguments     : distributor_params_t * p_params - pointer contains all infor of service
*                 uint8_t tariff_index - index tariff in array that need to get
*                 float32_t * p_data_get - output value of energy need to get
* Function Calls:
* Return Value  :
******************************************************************************/
static uint8_t GET_ImportApparentEnergyTariff(distributor_params_t * p_params, uint8_t tariff_index, float32_t * p_data_get)
{
	if(R_TARIFF_GetImportApparentEnergyTariff(tariff_index, p_data_get) == TARIFF_RET_OK)
    {
		return VAL_DATA_ACCESS_RESULT_SUCCESS;
    }
    else
    {
        R_DLMS_GetSetFail(p_params, VAL_DATA_ACCESS_RESULT_READ_WRITE_DENIED);
		return VAL_DATA_ACCESS_RESULT_READ_WRITE_DENIED;
    }
}

/******************************************************************************
* Function Name : R_DLMS_GetSetFail
* Interface     : R_DLMS_GetSetFail(uint8_t type_fail)
* Description   : Mark get/set service successfully
* Arguments     : distributor_params_t * p_params - pointer contains all infor of service
*                 uint8_t tariff_index - index tariff in array that need to get
*                 float32_t * p_data_get - output value of energy need to get
* Function Calls:
* Return Value  :
******************************************************************************/
static uint8_t GET_ImportActiveEnergyTariff(distributor_params_t * p_params, uint8_t tariff_index, float32_t * p_data_get)
{
	if(R_TARIFF_GetImportActiveEnergyTariff(tariff_index, p_data_get) == TARIFF_RET_OK)
    {
		return VAL_DATA_ACCESS_RESULT_SUCCESS;
    }
    else
    {
		return VAL_DATA_ACCESS_RESULT_READ_WRITE_DENIED;			
    }
}
/******************************************************************************
Private global variables and functions
******************************************************************************/
/**********************************************************************
***********************************************************************
*******************     PRIVATE GLOBAL VARIABLES       ****************
***********************************************************************
***********************************************************************
* Declare detail value to assign to Exported global variables if      *
* that is complex data type (struct or array)                         *
**********************************************************************/



/***********************************************************************************************************
* Object name:      System PF for billing period Import
* Object number:    00
* Object obis code: 1.0.13.0.0.255
***********************************************************************************************************/

/* !!!IMPORTANT INFO: this attribute have "GET" access right for some associations, if you would like to disable this code(off for above macro), please check and change access right of this parallel */
#if defined(CLASS03_OBJ00_ATTR02_GET_USERFUNCTION_ENABLE) && (CLASS03_OBJ00_ATTR02_GET_USERFUNCTION_ENABLE == TRUE)
/******************************************************************************
* Function Name : R_DLMS_USER_ic03_obj00_att02_get
* Description   : Object name       : System PF for billing period Import
*                 Object index      : 00
*                 Class             : 03
*                 Attribute order   : 02
*                 Attribute name    : value
*                 Association access: {1, Meter Reader}; {2, Utility Setting}; ; 
*                 Group object		: Billing
* Arguments     : distributor_params_t  * p_params -
*                   Contains all INPUT and OUTPUT of client and system.
*                 choice_t * p_attribute_get - OUTPUT
*                   Contains output data to send to client.
* Return Value  : uint8_t - result of get attribute
******************************************************************************/
uint8_t R_DLMS_USER_ic03_obj00_att02_get(distributor_params_t * p_params, choice_t * p_attribute_get)
{
	//uint8_t result = VAL_DATA_ACCESS_RESULT_OTHER_REASON;

