Tejaswini-KR/3-Phase-Smart-Meter/20231013_Smart_Meter_DLMS_v2_3_NPL_SM_3Ph4W_CS_Plus_E2_Studio_REL_NoAES - Copy/01.Source/rl78i1c/application/dlms2/usercode/r_dlms_usercode_class03.c
/* Declare for variable of Scaler_Unit (class - 03, atrribute - 03)*/
const scaler_unit_t g_dlms_ic03_obj00_att03_Scaler_Unit  = {0, PHY_UNIT_NONE};




/***********************************************************************************************************
* Object name:      Billing date
* Object number:    01
* Object obis code: 0.0.0.1.2.255
***********************************************************************************************************/

/* !!!IMPORTANT INFO: this attribute have "GET" access right for some associations, if you would like to disable this code(off for above macro), please check and change access right of this parallel */
#if defined(CLASS03_OBJ01_ATTR02_GET_USERFUNCTION_ENABLE) && (CLASS03_OBJ01_ATTR02_GET_USERFUNCTION_ENABLE == TRUE)
/******************************************************************************
* Function Name : R_DLMS_USER_ic03_obj01_att02_get
* Description   : Object name       : Billing date
*                 Object index      : 01
*                 Class             : 03
*                 Attribute order   : 02
*                 Attribute name    : value
*                 Association access: {1, Meter Reader}; {2, Utility Setting}; ; 
*                 Group object		: Billing
* Arguments     : distributor_params_t  * p_params -
*                   Contains all INPUT and OUTPUT of client and system.
*                 choice_t * p_attribute_get - OUTPUT
*                   Contains output data to send to client.
* Return Value  : uint8_t - result of get attribute
******************************************************************************/
uint8_t R_DLMS_USER_ic03_obj01_att02_get(distributor_params_t * p_params, choice_t * p_attribute_get)
{
	//uint8_t result = VAL_DATA_ACCESS_RESULT_OTHER_REASON;

	/* Configured Choice type: Octet_String */
	/* Length: 12 */
	
	/**************************************************************
	This is enum of return result value. 
	Default is VAL_DATA_ACCESS_RESULT_OTHER_REASON
	 typedef enum																																					*
	 {																																								*
	 	VAL_DATA_ACCESS_RESULT_SUCCESS 						= 0  ,																									*
	 	VAL_DATA_ACCESS_RESULT_HARDWARE_FAULT 				= 1  ,																									*
	 	VAL_DATA_ACCESS_RESULT_TEMPORARY_FAILURE 			= 2  ,																									*
	 	VAL_DATA_ACCESS_RESULT_READ_WRITE_DENIED 			= 3  ,																									*
	 	VAL_DATA_ACCESS_RESULT_OBJECT_UNDEFINED 			= 4  ,																									*
	 	VAL_DATA_ACCESS_RESULT_OBJECT_CLASS_INCONSISTENT 	= 9  ,																									*
	 	VAL_DATA_ACCESS_RESULT_OBJECT_UNAVAILABLE 			= 11 ,																									*
	 	VAL_DATA_ACCESS_RESULT_TYPE_UNMATCHED 				= 12 ,																									*
	 	VAL_DATA_ACCESS_RESULT_SCOPE_OF_ACCESS_VIOLATED 	= 13 ,																									*
	 	VAL_DATA_ACCESS_RESULT_DATA_BLOCK_UNAVAILABLE 		= 14 ,																									*
	 	VAL_DATA_ACCESS_RESULT_LONG_GET_ABORTED 			= 15 ,																									*
	 	VAL_DATA_ACCESS_RESULT_NO_LONG_GET_IN_PROGRESS 		= 16 ,																									*
	 	VAL_DATA_ACCESS_RESULT_LONG_SET_ABORTED 			= 17 ,																									*
	 	VAL_DATA_ACCESS_RESULT_NO_LONG_SET_IN_PROGRESS 		= 18 ,																									*
	 	VAL_DATA_ACCESS_RESULT_DATA_BLOCK_NUMBER_INVALID 	= 19 ,																									*
	  	VAL_DATA_ACCESS_RESULT_OTHER_REASON 				= 250,																									*
	 } DataAccessResult_Value;	
	***************************************************************/
	/* TODO Please assign your data here */
	/* Assign link data here */
	// uint8_t link_data_value[] = NULL;
	// /* Please update link_data_length after assign link_data_value */
	// uint16_t link_data_length = 12;
	// p_attribute_get->choice.size = link_data_length;
	// memcpy(p_attribute_get->buffer, &link_data_value, link_data_length);

	/* Start user code here */
	uint8_t time_schedule[3];
	uint8_t date_schedule[4];
	uint16_t year;
	date_time_t billing_datetime = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
		                            0xFF, 0xFF, 0xFF, 0x80, 0x00, 0xFF};
	uint16_t length_array;


    /* Get length of execution time of billing */
	length_array = R_SCHEDULER_ExecutionTimeArrayLengthGet(3);//3 is scheduler id of billing

	/* 
	 * If length of execution time of schedule is 0 or more than SCHEDULE_EXE_TIME_MAX_SUPPORT_3
	 * Return not specific value
	 */
	if((length_array <= 0) || (length_array > SCHEDULE_EXE_TIME_MAX_SUPPORT_3))
	{
		p_attribute_get->choice.size = 12;
		memcpy(p_attribute_get->buffer, &billing_datetime, 12);
		return VAL_DATA_ACCESS_RESULT_READ_WRITE_DENIED;
	}


	R_SCHEDULER_ExecutionTimeGet(time_schedule, 3, 0);//3 is scheduler id of billing
	R_SCHEDULER_ExecutionDateGet(date_schedule, 3, 0);//3 is scheduler id of billing
	
	/* Convert data date and time of schedule to data_time of passive active calendar */
	if (date_schedule[0] == 0xFF)
	{
		billing_datetime.year_high = 0xFF;
		billing_datetime.year_low = 0xFF;
	}
	else
	{
		year = 2000 + (uint16_t)date_schedule[0];
		billing_datetime.year_high = (uint8_t)(year >> 8);
		billing_datetime.year_low = (uint8_t)year;
	}
     
	billing_datetime.month = date_schedule[1];         
	billing_datetime.day_of_week = date_schedule[2];   
	billing_datetime.day_of_month = date_schedule[3];  
	billing_datetime.hour = time_schedule[0];          
	billing_datetime.minute = time_schedule[1];        
	billing_datetime.second = time_schedule[2];
	/*
	 * According to DLMS bluebook
	 * A definition with "not specified" notation in all fields of the attribute will deactivate this automatism.
	 * Partial "not specified" notation in just some fields of date and time are not allowed.
	 */
	if ((date_schedule[0] & date_schedule[1] & date_schedule[2] & date_schedule[3] &
		 time_schedule[0] & time_schedule[1] & time_schedule[2]) == 0xFF)
	{
		billing_datetime.hundredths = 0xFF;//As mention of bluebook, class22, attirbute 04  
		billing_datetime.deviation_high = 0x80;//Not specified
		billing_datetime.deviation_low = 0x00;//Not specified
		billing_datetime.clock_status = 0xFF;//Not specified
	}
	else
	{
		billing_datetime.hundredths = 0;//As mention of bluebook, class22, attirbute 04  
		billing_datetime.deviation_high = (int8_t)(g_time_zone>>8);
    	billing_datetime.deviation_low = (int8_t)g_time_zone;
		billing_datetime.clock_status = g_clock_status;
	}

	p_attribute_get->choice.size = 12;
	memcpy(p_attribute_get->buffer, &billing_datetime, 12);
	/* End user code here */
	/* Return result of this, please check again result value */
	return VAL_DATA_ACCESS_RESULT_SUCCESS;
}
#endif

